app/views/pages/dashboard.html.erb

SELECT COUNT(*) FROM "connections" WHERE "connections"."user_id" = ? AND "connections"."provider" = ?  [["user_id", 1], ["provider", "twitter"]]
---
    <div class="social">
      <% unless current_user.connections.where(provider: 'twitter').any? %>